tutorials/fsiFoam/3dTube/fluid/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    IQNILS;

IQNILSCoeffs
{
    solidPatch inner-wall;
    solidZone inner-wall-zone;

    fluidPatch wall;
    fluidZone wall-zone;

    relaxationFactor 0.05;

    interfaceDeformationLimit 0;

    outerCorrTolerance 1e-6;
    nOuterCorr 30;

    interpolatorUpdateFrequency 0;

    couplingReuse 1;

    coupled yes;
}

// ************************************************************************* //
